
## Plan Result (portfolio/time_capsule)

[CI link](https://github.com/tqer39/terraform-aws/actions/runs/8498653890)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Delete
  * module.deploy_role.aws_iam_policy.this
* Replace
  * module.deploy_role.aws_iam_role.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.deploy_role.aws_iam_policy.this will be destroyed
  # (because aws_iam_policy.this is not in configuration)
  - resource "aws_iam_policy" "this" {
      - arn       = "arn:aws:iam::072693953877:policy/portfolio-terraform-vercel-deploy" -> null
      - id        = "arn:aws:iam::072693953877:policy/portfolio-terraform-vercel-deploy" -> null
      - name      = "portfolio-terraform-vercel-deploy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::terraform-tfstate-tqer39-072693953877-ap-northeast-1/terraform-vercel/*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPARB3HFWVKSUQHDHCK5" -> null
      - tags      = {
          - "pl:source_path" = "./terraform/environments/portfolio/terraform_vercel"
        } -> null
      - tags_all  = {
          - "pl:environment" = "portfolio"
          - "pl:iac"         = "terraform"
          - "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          - "pl:product"     = "terraform-aws"
          - "pl:repository"  = "tqer39/terraform-aws"
          - "pl:source_path" = "./terraform/environments/portfolio/terraform_vercel"
        } -> null
    }

  # module.deploy_role.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::072693953877:role/portfolio-terraform-vercel-deploy" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:tqer39/terraform-vercel:*" -> "repo:tqer39/time-capsule:*"
                            }
                        }
                      - Sid       = ""
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
      ~ create_date           = "2023-05-20T01:14:04Z" -> (known after apply)
      ~ id                    = "portfolio-terraform-vercel-deploy" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::072693953877:policy/portfolio-terraform-vercel-deploy",
          + "arn:aws:iam::072693953877:policy/deploy-allow-specifics",
            # (1 unchanged element hidden)
        ]
      ~ name                  = "portfolio-terraform-vercel-deploy" -> "portfolio-time-capsule-deploy" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "pl:source_path" = "./terraform/environments/portfolio/terraform_vercel"
        } -> null
      ~ tags_all              = {
          ~ "pl:source_path" = "./terraform/environments/portfolio/terraform_vercel" -> "./terraform/environments/portfolio/time_capsule"
            # (5 unchanged elements hidden)
        }
      ~ unique_id             = "AROARB3HFWVK7U5IOIEFP" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-aws-portfolio","PRNumber":764,"Program":"tfcmt","SHA1":"f67f5fc48dd3cff3dfc075db697be9acdd1eea35","Target":"portfolio/time_capsule","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->